/*
 * Localizable.strings (Russian)
 * PushToTalk
 */

// MARK: - Application

"app.name" = "PushToTalk";
"app.settings" = "Настройки";
"app.quit" = "Выход";
"app.about" = "О программе";

// MARK: - Menu Bar

"menubar.recording" = "Запись";
"menubar.ready" = "Готов";
"menubar.processing" = "Обработка";
"menubar.error" = "Ошибка";
"menubar.settings" = "Настройки";
"menubar.audioDevice" = "Аудиоустройство";
"menubar.noDevicesAvailable" = "Нет доступных устройств";
"menubar.refreshList" = "Обновить список";
"menubar.quit" = "Выход";
"menubar.deviceChanged" = "Аудиоустройство изменено";
"menubar.selectedDevice" = "Выбрано:";
"menubar.listRefreshed" = "Список обновлен";
"menubar.devicesFound" = "Найдено устройств:";

// MARK: - Settings Sections

"sections.debug" = "Отладка";
"sections.general" = "Основные";
"sections.models" = "Модели";
"sections.hotkeys" = "Горячие клавиши";
"sections.vocabulary" = "Словарь";
"sections.audio" = "Аудио";
"sections.history" = "История";

// MARK: - General Settings

"general.title" = "Основные настройки";
"general.stopWords" = "Стоп-слова";
"general.stopWordsDescription" = "Слова для отмены записи";
"general.addStopWord" = "Добавить стоп-слово";
"general.maxRecordingDuration" = "Максимальная длительность записи";
"general.maxRecordingDescription" = "Максимальное время записи в секундах";
"general.seconds" = "секунд";

// MARK: - Model Settings

"models.title" = "Настройки модели";
"models.currentModel" = "Текущая модель";
"models.availableModels" = "Доступные модели";
"models.downloadModel" = "Скачать модель";
"models.deleteModel" = "Удалить модель";
"models.modelSize" = "Размер модели";
"models.modelStatus" = "Статус модели";
"models.downloaded" = "Загружено";
"models.notDownloaded" = "Не загружено";
"models.downloading" = "Загрузка";
"models.deleteConfirmation" = "Вы уверены, что хотите удалить модель %@? Это действие необратимо.";
"models.deleteTitle" = "Удалить модель";
"models.cancel" = "Отмена";
"models.delete" = "Удалить";

// MARK: - Hotkey Settings

"hotkeys.title" = "Настройки горячих клавиш";
"hotkeys.currentHotkey" = "Текущая горячая клавиша";
"hotkeys.recordNewHotkey" = "Записать новую горячую клавишу";
"hotkeys.pressHotkey" = "Нажмите комбинацию клавиш";
"hotkeys.functionKeys" = "Функциональные клавиши";
"hotkeys.modifiers" = "Модификаторы";
"hotkeys.noModifier" = "Без модификатора";

// MARK: - Vocabulary Settings

"vocabulary.title" = "Настройки словаря";
"vocabulary.customPrompt" = "Пользовательский промпт";
"vocabulary.customPromptDescription" = "Дополнительные термины для лучшего распознавания";
"vocabulary.programmingPrompt" = "Использовать программистский промпт";
"vocabulary.programmingPromptDescription" = "Включить общие программистские термины";
"vocabulary.vocabularies" = "Пользовательские словари";
"vocabulary.addVocabulary" = "Добавить словарь";
"vocabulary.vocabularyName" = "Название словаря";
"vocabulary.words" = "Слова";
"vocabulary.wordsPlaceholder" = "Введите слова через запятую";
"vocabulary.enabled" = "Включено";
"vocabulary.disabled" = "Выключено";
"vocabulary.language" = "Язык";
"vocabulary.languageDescription" = "Язык транскрипции";
"vocabulary.russian" = "Русский";
"vocabulary.english" = "Английский";

// MARK: - Audio Settings

"audio.title" = "Настройки аудио";
"audio.inputDevice" = "Устройство ввода";
"audio.inputDeviceDescription" = "Микрофон для записи";
"audio.defaultDevice" = "Устройство по умолчанию";
"audio.testRecording" = "Тестовая запись";
"audio.stopTest" = "Остановить тест";
"audio.soundEffects" = "Звуковые эффекты";
"audio.soundEffectsDescription" = "Воспроизводить звуки при старте/остановке записи";
"audio.audioDucking" = "Приглушение звука";
"audio.audioDuckingDescription" = "Уменьшать громкость медиа во время записи";
"audio.microphoneVolume" = "Громкость микрофона";
"audio.volumeBoost" = "Усиление громкости";

// MARK: - History Settings

"history.title" = "История транскрипций";
"history.noEntries" = "Пока нет транскрипций";
"history.entries" = "записей";
"history.copyToClipboard" = "Копировать в буфер обмена";
"history.deleteEntry" = "Удалить запись";
"history.clearHistory" = "Очистить историю";
"history.clearConfirmation" = "Вы уверены, что хотите очистить всю историю?";
"history.clearTitle" = "Очистить историю";
"history.exportHistory" = "Экспортировать историю";
"history.exportSuccess" = "Экспорт выполнен";
"history.exportSuccessMessage" = "История экспортирована в папку Загрузки";
"history.ok" = "OK";

// MARK: - Debug Settings

"debug.title" = "Настройки отладки";
"debug.viewLogs" = "Просмотр логов";
"debug.openLogFolder" = "Открыть папку с логами";
"debug.clearLogs" = "Очистить логи";
"debug.enableDebugMode" = "Включить режим отладки";
"debug.debugModeDescription" = "Показывать детальную отладочную информацию";
"debug.performanceMetrics" = "Метрики производительности";
"debug.showMetrics" = "Показать метрики производительности";
"debug.realTimeFactor" = "Фактор реального времени";
"debug.transcriptionSpeed" = "Скорость транскрипции";

// MARK: - File Transcription

"fileTranscription.title" = "Транскрипция файла";
"fileTranscription.mode" = "Режим транскрипции";
"fileTranscription.vadMode" = "VAD (определение голосовой активности)";
"fileTranscription.vadModeDescription" = "Автоматическое определение сегментов речи. Рекомендуется для большинства случаев.";
"fileTranscription.batchMode" = "Batch (фиксированные фрагменты)";
"fileTranscription.batchModeDescription" = "Разделение на равные части с перекрытием. Альтернативный метод.";
"fileTranscription.vadAlgorithm" = "Алгоритм VAD";
"fileTranscription.selectFile" = "Выбрать файл";
"fileTranscription.startTranscription" = "Начать транскрипцию";
"fileTranscription.stopTranscription" = "Остановить транскрипцию";
"fileTranscription.progress" = "Прогресс";
"fileTranscription.transcribing" = "Транскрибируется";

// MARK: - Permissions

"permissions.microphoneRequired" = "Требуется разрешение на микрофон";
"permissions.microphoneDescription" = "PushToTalk нужен доступ к микрофону для записи аудио";
"permissions.openSettings" = "Открыть настройки";
"permissions.permissionDenied" = "Разрешение отклонено";

// MARK: - Errors

"errors.title" = "Ошибка";
"errors.modelLoadFailed" = "Не удалось загрузить модель";
"errors.modelNotSupported" = "Модель не поддерживается";
"errors.modelDownloadFailed" = "Не удалось скачать модель";
"errors.modelDeleteFailed" = "Не удалось удалить модель";
"errors.recordingFailed" = "Не удалось начать запись";
"errors.transcriptionFailed" = "Транскрипция не удалась";
"errors.audioDeviceError" = "Ошибка аудиоустройства";
"errors.unknownError" = "Произошла неизвестная ошибка";
"errors.tryAgain" = "Попробовать снова";
"errors.dismiss" = "Закрыть";

// MARK: - Status Messages

"status.ready" = "Готов";
"status.recording" = "Запись...";
"status.processing" = "Обработка...";
"status.transcribing" = "Транскрибируется...";
"status.completed" = "Завершено";
"status.cancelled" = "Отменено";
"status.modelLoading" = "Загрузка модели...";
"status.modelLoaded" = "Модель загружена";

// MARK: - Buttons

"buttons.ok" = "OK";
"buttons.cancel" = "Отмена";
"buttons.delete" = "Удалить";
"buttons.save" = "Сохранить";
"buttons.apply" = "Применить";
"buttons.close" = "Закрыть";
"buttons.done" = "Готово";
"buttons.add" = "Добавить";
"buttons.remove" = "Удалить";
"buttons.edit" = "Редактировать";
"buttons.export" = "Экспорт";
"buttons.import" = "Импорт";

// MARK: - Units

"units.seconds" = "с";
"units.minutes" = "мин";
"units.hours" = "ч";
"units.kilobytes" = "КБ";
"units.megabytes" = "МБ";
"units.gigabytes" = "ГБ";

// MARK: - Quality Enhancement

"quality.title" = "Улучшение качества";
"quality.enabled" = "Включить улучшение качества";
"quality.enabledDescription" = "Использовать расширенные настройки для лучшего качества транскрипции";
"quality.temperatureFallback" = "Резервная температура";
"quality.temperatureFallbackDescription" = "Несколько попыток с разными температурами";
"quality.compressionRatio" = "Порог коэффициента сжатия";
"quality.compressionRatioDescription" = "Фильтровать галлюцинации (по умолчанию: 2.4)";
"quality.logProbThreshold" = "Порог логарифмической вероятности";
"quality.logProbThresholdDescription" = "Фильтровать результаты с низкой уверенностью (по умолчанию: -1.0)";

// MARK: - VAD Algorithms

"vadAlgorithms.spectralTelephone" = "Спектральный VAD - Телефонный (рекомендуется)";
"vadAlgorithms.spectralTelephoneDescription" = "FFT анализ для телефонного аудио (300-3400 Гц). Лучше всего для записей звонков.";
"vadAlgorithms.spectralWideband" = "Спектральный VAD - Широкополосный";
"vadAlgorithms.spectralWidebandDescription" = "FFT анализ для широкополосного аудио (80-8000 Гц). Для качественных записей.";
"vadAlgorithms.spectralDefault" = "Спектральный VAD - По умолчанию";
"vadAlgorithms.spectralDefaultDescription" = "FFT анализ, стандартный режим. Универсальный вариант.";
"vadAlgorithms.adaptiveLowQuality" = "Адаптивный VAD - Низкое качество";
"vadAlgorithms.adaptiveLowQualityDescription" = "Адаптивный порог + ZCR для низкого качества. Автоматически подстраивается под шум.";
"vadAlgorithms.adaptiveAggressive" = "Адаптивный VAD - Агрессивный";
"vadAlgorithms.adaptiveAggressiveDescription" = "Агрессивная сегментация. Много коротких сегментов.";
"vadAlgorithms.standardLowQuality" = "Стандартный VAD - Низкое качество";
"vadAlgorithms.standardLowQualityDescription" = "Энергетический метод для телефонного аудио. Простой и быстрый.";
"vadAlgorithms.standardHighQuality" = "Стандартный VAD - Высокое качество";
"vadAlgorithms.standardHighQualityDescription" = "Энергетический метод для чистого аудио. Более точная сегментация.";

// MARK: - Notifications

"notifications.recordingStarted" = "Запись началась";
"notifications.recordingStopped" = "Запись остановлена";
"notifications.transcriptionCompleted" = "Транскрипция завершена";
"notifications.modelChanged" = "Модель изменена на %@";
"notifications.modelDownloaded" = "Модель %@ загружена";
"notifications.modelDeleted" = "Модель %@ удалена";

// MARK: - General Settings (Additional)

"general.stopWordsTitle" = "Стоп-слова";
"general.recordingSettings" = "Настройки записи";

// MARK: - Hotkeys (Additional)

"hotkeys.hotkeySelection" = "Выбор горячей клавиши";
"hotkeys.activeHotkey" = "Активная горячая клавиша:";
"hotkeys.hotkey" = "Горячая клавиша";

// MARK: - Vocabulary (Additional)

"vocabulary.addNewVocabulary" = "Добавить новый словарь";

// MARK: - Audio (Additional)

"audio.audioInput" = "Аудио вход";
"audio.audioSettings" = "Настройки аудио";

// MARK: - History (Additional)

"history.testRecording" = "Тестовая запись";
"history.noTranscriptions" = "Пока нет транскрипций";
"history.pressHotkeyToRecord" = "Нажмите и удерживайте горячую клавишу для начала записи";
"history.recording" = "Запись...";
"history.total" = "Всего:";
"history.words" = "Слов:";
"history.avgTime" = "Ср. время:";
"history.copy" = "Копировать";
"history.export" = "Экспорт";
"history.clearAll" = "Очистить всё";

// MARK: - Debug (Additional)

"debug.mediaRemoteControls" = "Управление медиа";
"debug.pause" = "Пауза";
"debug.resume" = "Возобновить";
"debug.togglePlayPause" = "Переключить воспр./паузу";
"debug.getNowPlayingInfo" = "Получить информацию о воспроизведении";
"debug.audioDucking" = "Приглушение аудио";
"debug.duck" = "Приглушить";
"debug.unduck" = "Восстановить";
"debug.microphoneVolume" = "Громкость микрофона";
"debug.boost" = "Усилить";
"debug.restore" = "Восстановить";
"debug.logs" = "Логи";
"debug.copyCommand" = "Копировать команду";
≨潴步祳⹨潴步祓敬散瑩潮∠㴠⋐鋑诐뇐뻑耠킳킾톀톏톇킵킹⃐뫐믐냐닐룑裐렢㬊≨潴步祳⹡捴楶效潴步礢‽•킐킺톂킸킲킽킰톏⃐돐뻑胑近蟐냑輠킺킻킰킲킸톈킰∻ਢ桯瑫敹献桯瑫敹∠㴠⋐鏐뻑胑近蟐냑輠킺킻킰킲킸톈킰∻ਢ桯瑫敹献灲敳整䵯摥∠㴠⋐ꇑ苐냐뷐듐냑胑苐뷑诐딠䘭킺킻킰킲킸톈킸∻ਢ桯瑫敹献捵獴潭䵯摥∠㴠⋐鿐뻐믑賐럐뻐닐냑苐뗐믑賑臐뫐냑輠킺킾킼킱킸킽킰톆킸톏∻ਢ桯瑫敹献浯摥卥汥捴楯渢‽•킠킵킶킸킼⃐돐뻑胑近蟐룑蔠킺킻킰킲킸톈∻ਢ桯瑫敹献慣捥獳楢楬楴祒敱畩牥搢‽•킔킻톏⃐뿐뻐믑賐럐뻐닐냑苐뗐믑賑臐뫐룑蔠킺킾킼킱킸킽킰톆킸킹⃑苑胐뗐뇑菐뗑苑臑輠톀킰킷톀킵톈킵킽킸킵⁁捣敳獩扩汩瑹∻�